# Задание 7 **
# Предложите свой вариант ситуации, когда для сохранения информации используются разные типы данных (опишите ситуацию, как в предыдущем задании).



Ответ:
Спиок товаров на складе.
Данные будут хранится в следующнм виде:

ID - int (порядковый номер в каталоге)
Group int - String (Типы товаров ). int (номера групп) связаны со справочником групп товаров.
Name - String (Наименование товара)
Description - String (Описание)
Price - Float (Цена товара)
Availability - boolean - (наличие на складе)
Rating - int (Рейтинг, популярность)
